Documents/ESB/ESB_Consumer_0612/003TestSample/SAMPLE_XML_MUST/PaymentOrder/PO02_FiscTxnLogSummInqRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/PaymentOrder/FiscTxnLogSummInqRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>PaymentOrder</ServiceDomain>  
      <OperationName>FiscTxnLogSummInq</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:FiscTxnLogSummInqRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>PO02</v11:TxnId>  
        <v11:TxnNo>PO0200001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <v11:StartDate>2019-06-08</v11:StartDate>  
        <v11:EndDate>2019-08-08</v11:EndDate>  
        <!--Optional:-->  
        <v11:AcqBankId>1234567</v11:AcqBankId>  
        <v11:TxnSeqNo>1234567</v11:TxnSeqNo>  
        <v11:FrstInqFlg>true</v11:FrstInqFlg>  
        <v11:NoOfPage>7</v11:NoOfPage>  
        <v11:NextInqKeyId>0</v11:NextInqKeyId> 
      </v11:ServiceBody> 
    </v11:FiscTxnLogSummInqRq> 
  </soap:Body> 
</soap:Envelope>
